'''1)	Напишите счетчик с помощью конструкции while, который выводит числа от 0 до 10.
   2)	Напишите счетчик с помощью конструкции while, который выводит числа от 20 до 1.
'''
# 1)
n = 0
while n <= 10:
    print(n, sep='\n')
    n += 1

# 2)
n = 20
while n >= 1:
    print(n, sep='\n')
    n -= 1